Repository: apertium/apertium-eo-en
Catalog: corpa/bil/remington.tmx
Source language: eo
Languages: en

source: La Remington
en: The Remington

source: LA UNIVERSALA SKRIBMAŜINO
en: THE UNIVERSAL TYPEWRITER

source: Pripensu je tio!
en: Just think of it!

source: LA INTERNACIA MAŜINO
en: THE INTERNATIONAL MACHINE

source: Tute liberiĝita de naciaj ligiloj:
en: Unbound by ties of nationality:

source: La Komuna unuigilo por ĉiuj civilizitaj popoloj
en: The common bond of union of all civilised peoples

source: La Remington estos liverita kun Esperantaj presliteroj
en: The Remington can be supplied fitted for Esperanto

source: LA REMINGTON TYPEWRITER KOMPANIO,
en: THE REMINGTON TYPEWRITER COMPANY,

source: 100, Gracechurch St., Londono, E.C
en: 100, Gracechurch St., London, E.C
